export default {
  namespaced: true,
  state: {
    list: [{
      name: 'Анастасия Могило',
      img: '/img/feedback/Le0U967EIlY.jpg',
      desc: 'Посетила "Алтайскую здравницу" впервые🌿 На ресепшене встретила очень приятная девушка Наталья, арома-бочка просто чудо,после тяжелого и стрессового дня расслабляет моментально, пихтовые ароматы облегчают дыхание🌲🍃 После бочки был массаж😍,руки у Екатерины просто золотые👍 Пориятно поболтать в такой обстановке😊👌🏼 После всего этого релакса предлагают пройти в чайную комнату,где уже готов ооооочень ароматный травяной чай☕ с ягодками. На протяжении всех процедур тебя сопровождаете расслабляющая музыка и звуки природы🎼 Впечатления однозначно положительные! Все чистое,новое. Приду ещё не один раз и приведу маму.',
      city: 1
    },
    {
      name: 'Оля Глухова',
      img: '/img/feedback/8KQSE-SgUGk.jpg',
      desc: 'Мои друзья побаловали меня , подарив подарочный сертификат на СПА -программу" Клеопатра". И я попала в сказку! Тихая, спокойная музыка-дарующая гармонию и расслабления, волшебные ароматы-кедра, шоколада, молока. Прекрасный персонал , внимательные и учтивые девочки. Все процедуры , что включены в программу очень понравились, каждая индивидуальна и приятна по своему, окунули меня в пространство покоя. Пусть каждая девушка, женщина побывав на СПА -программе почувствует себя царицей. Благодарю, за подаренные мгновения счастье.',
      city: 1
    },
    {
      name: 'Ксения Артемова',
      img: '/img/feedback/Upv91iM0SRQ.jpg',
      desc: 'Сегодня побывала в этом чудесном месте! Полный восторг! Понравилось все: удобное местоположение салона, вежливый и заботливый персонал, отличный сервис, фитобочка, массаж, вкусный чай! Приятная, действително расслабляющая атмосфера. Чудесный запах. Все гигиенично. Чисто. Екатерина сделала очень хороший массаж! Спасибо еще раз, обязательно к вам вернусь!☺',
      city: 1
    },
    {
      name: 'Анастасия Молокова',
      img: '/img/feedback/T1awSpOyDog.jpg',
      desc: 'Мне очень нравится возвращаться в «Алтайскую здравницу», где такая расслабляющая атмосфера, очень приветливый персонал, где можно полностью отключиться от повседневных забот. Особенно хочется отметить мастера Анну и ее волшебные руки. После программы «Дикая ягода» кожа мягкая, гладкая и напитанная. Спасибо 😊',
      city: 2
    },
    {
      name: 'Лена Левочкина',
      img: '/img/feedback/lovochkina.jpg',
      desc: 'Мне посчастливилось насладиться необыкновенной спа-программой "Кедровый звон". Когда я зашла в центр, меня сразу окутал очень вкусный для меня аромат хвои и трав, добавить к этому уютную обстановку, приглушенный свет, тихую красивую музыку и внимательных девушек-хранительниц этой сказки:) Разогрев в кедровой арома-бочке, пилинг тела с березовым соком и измельченными кедровыми орешками, глубокий расслабляющий массаж от Екатерины, душистый травяной чай... Ммммммм.... нежная бархатистая кожа, расслабление и каждая клеточка моего тела говорит "спасибо":) Вот рецепт блаженства, красоты, здоровья и хорошего настроения:) ?? "Алтайская здравница"! Я хочу в твои объятья вновь!',
      city: 3
    },
    {
      name: 'Максим Ложкин',
      img: '/img/feedback/lojkin.jpg',
      desc: 'Вы были в фитобочке? Я был первый раз и был в восторге! Тем более когда на работе столько движения, иногда нужно остановиться, чтобы прочувствовать жизнь, а сделать это лучше всего в правильном месте! После фитобочки меня ждал супер массаж! Я очень люблю массаж, а особенно когда это делалает человек, который любит своё ремесло и вкладывает душу в свою работу! По завершению мероприятия мне предложили восхитительный травяной чаёк! Спасибо вам за супер релакс!!! Обязательно посетите это волшебное место!',
      city: 3
    },
    {
      name: 'Татьяна Шпичко',
      img: '/img/feedback/shpichko.jpg',
      desc: 'Мне сделали невероятный подарок- сертификат на расслабляющие процедуры в "Алтайскую здравницу" и попали прямо в точку. Переступив порог, ты забываешь обо всем и попадаешь в сказку, которая нацелена только на тебя, на твой эмоциональный покой и безмятежное погружение в мир звуков и ароматов природы. Побывав в фито-бочке и почувствовав как  окутывает травяной пар, слушая звуки природы и глядя, как лаконично оформлена сама комната, ты видишь магию совершенства везде. Будучи, уже мягкой и послушной как тряпочка тебя проводят на пилинг с волнующими запахами трав и меда и тело под нежными руками Ирины, становится как у Королевы. Время не чувствуешь, хочется еще и еще))Спасибо огромное и до скорой встречи?',
      city: 3
    },
    {
      name: 'Мария Буракова',
      img: '/img/feedback/burakova.jpg',
      desc: 'Я посетила сеанс арома-сауны и релаксирующий массаж. Арома-сауна перенесла меня в сосновый лес, и я почувствовала себя одной из сосен, обливающихся смолой. И этот обволакивающий приятный хвойный аромат.. Релаксирующий массаж позволил мне расслабиться, отпустить напряжение с мышц и, к удивлению, наполнил меня силами и хорошим настроением! Благодарю за теплый прием и ароматный полезный чай! Непременно вернусь к вам снова!',
      city: 2
    },
    {
      name: 'Юлия Книжова',
      img: '/img/feedback/knijova.jpg',
      desc: '... Спасибо за обретение душевного спокойствия и гармонии, за мои воистину восстановленные силы, за "отключение" в прямом смысле слова от всего мира на эти 2 часа релакса и полной расслабленности моего организма, было очень своевременно и необходимо!?????? Таёжный SPA - спасибо большое за блаженство!!!????"',
      city: 2
    }
  ]
  },
  getters: {
    list (state) {
      return state.list
    },
    currenCityList (state, getters) {
      return city => getters.list.filter(item => item.city == city)
    }
  }
}